tap 'homebrew/bundle'
tap 'jesseduffield/lazygit'
tap 'minacle/chntpw/chntpw'
tap 'nicoverbruggen/homebrew-cask'
tap 'iina/homebrew-mpv-iina'

# Core
brew 'bats-core'
brew 'coreutils' 						                # Those that come with macOS are outdated
brew 'mackup'							                  # Keep your Mac's application settings in sync
brew 'mas' 								                  # Mac App Store command-line interface
brew 'nano'	
brew 'stow'								                  # Organize software neatly under a single directory tree
brew 'topgrade'							                # Upgrade everything and everywhere
brew 'neovim'							                  # Ambitious Vim-fork focused on extensibility and agility


# Binaries
brew 'ant'								                  # Java build tool
brew 'aria2'							                  # Download with resuming and segmented downloading
brew 'cabextract'
brew 'cdrtools'
brew 'duti'
brew 'exa'  							                  # Modern replacement for 'ls'
brew 'freetds'							                # Natively talk to Microsoft SQL Server and Sybase databases
brew 'gh'
brew 'git'								                  # Revision control system
brew 'git-extras'
brew 'git-delta'						                # Syntax-highlighting pager for git and diff output
brew 'gnupg'
brew 'krb5'
brew 'libpq'
brew 'minacle/chntpw/chntpw'
brew 'openssl'
brew 'pcre2'
brew 'pkg-config' 						              # https://github.com/driesvints/dotfiles/issues/20
brew 'svn'								                  # Needed to install fonts
brew 'tart'                                 # macOS and Linux VMs on Apple Silicon to use in CI and other automations
brew 'terminal-notifier' 				            # Send macOS User Notifications from the command-line
brew 'tmux'								                  # Terminal multiplexer
brew 'wimlib'
brew 'zsh'
brew 'zsh-syntax-highlighting'


# FS/Network
brew 'curl'								                  # Transfer data using various network protocols
brew 'fd'								                    # Simple, fast and user-friendly alternative to find
brew 'fzf'
brew 'gnu-sed'
brew 'grep'
brew 'nmap'
brew 'telnet'
brew 'tor'
brew 'tree'								                  # List the contents of directories in an intuitive way
brew 'speedtest_cli'
brew 'ssh-copy-id'
brew 'wget'								                  # Internet file retriever


# Development Tools
brew 'cloudflared'						              # Cloudflare Tunnel client (formerly Argo Tunnel)
brew 'colima'											# Container runtimes on macOS (and Linux) with minimal setu
brew 'composer'
brew 'docker'
brew 'fnm'								                  # Node version management
brew 'mutagen-io/mutagen/mutagen'
brew 'mutagen-io/mutagen/mutagen-compose'
brew 'n'								                    # Node package version
brew 'php@8.2'
brew 'phpunit'
brew 'podman-compose'					              # Alternative to docker-compose using podman
brew 'pyenv'  							                # Python version management
brew 'pyenv-virtualenv'
brew 'redis'
brew 'rust'
brew 'unixodbc'							                # Predictable API with which to access Data Sources


# Media
brew 'mpv-iina'
brew 'ffmpeg'
brew 'imagemagick'
brew 'uni'
brew 'webp'
brew 'youtube-dl'


# Mac App Store
mas 'Amphetamine',  id: 937984704
mas 'Keynote',      id: 409183694
mas 'Numbers',      id: 409203825
mas 'Pages',        id: 409201541
mas 'Spark', 		    id: 1176895641
mas 'Speedtest', 	  id: 1153157709
mas 'Wireguard'		  id: 1451685025
mas 'Xcode',        id: 497799835
