tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'jesseduffield/lazygit'
tap 'nicoverbruggen/homebrew-cask'


# Binaries
brew 'ant'
brew 'bash' 							# Latest Bash version
brew 'coreutils' 						# Those that come with macOS are outdated
brew 'curl'
brew 'exa'  							# Modern replacement for 'ls'
brew 'fd'								# Simple, fast and user-friendly alternative to find
brew 'ffmpeg'
brew 'gh'
brew 'git'								# Distributed revision control system
brew 'git-delta'						# Syntax-highlighting pager for git and diff output
brew 'gnupg'
brew 'grep'
brew 'krb5'
brew 'libpq'
brew 'mackup'
brew 'mas' 								# Mac App Store command-line interface
brew 'openssl'
brew 'pkg-config' 						# https://github.com/driesvints/dotfiles/issues/20
brew 'pyenv'  							# Python version management
brew 'svn'								# Needed to install fonts
brew 'terminal-notifier' 				# Send macOS User Notifications from the command-line
brew 'telnet'
brew 'tree'								# List the contents of directories in an intuitive way
brew 'tmux'								# Terminal multiplexer
brew 'wget'								# Internet file retriever
brew 'zsh'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'


# Development
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'node'
brew 'php'
brew 'php@8.0'
brew 'php@7.4'
brew 'phpunit'
brew 'redis'
brew 'yarn'


# Apps
cask 'appcleaner'
cask 'authy'
cask 'diffmerge'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'font-hack'
cask 'gitup'
cask 'gpg-suite'
cask 'google-chrome'
cask 'handbrake'
cask 'iterm2'
cask 'notion'
cask 'pastebot'
cask 'phpmon'
cask 'postman'
cask 'raycast'
cask 'rectangle'
cask 'responsively'
cask 'sequel-ace'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'transmission'
cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'
cask 'wkhtmltopdf'
cask 'zoom'


# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'


# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'


# Mac App Store
mas 'Amphetamine',  id: 937984704
mas 'Fantastical',  id: 975937182 
mas 'Moom', 		id: 419330170
mas 'Slack', 		id: 803453959
mas 'Spark', 		id: 1176895641
mas 'Speedtest', 	id: 1153157709
